Revit 2026 API

# RelinquishOptions Properties

---

The RelinquishOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CheckedOutElements | True means all elements checked out by the current user should be relinquished. False means none of these are relinquished. |
|  | FamilyWorksets | True means all family worksets owned by the current user should be relinquished. False means none of these are relinquished. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StandardWorksets | True means all project standards worksets owned by the current user should be relinquished. False means none of these are relinquished. |
|  | UserWorksets | True means all user-created worksets owned by the current user should be relinquished. False means none of these are relinquished. |
|  | ViewWorksets | True means all view worksets owned by the current user should be relinquished. False means none of these are relinquished. |

#### Reference

RelinquishOptions Class

Autodesk.Revit.DB Namespace